org/notes/20231114131806-principles.org
:PROPERTIES:
:ID:       902575EE-119F-4F7F-BF0F-AF1479E6030B
:END:
#+title: Principles
#+hugo_draft: true

- tags :: [[id:DCDF7171-E206-46AD-9A70-BDB9760E347D][Growth and Habits]] 


* Be mindful about consumption - is this helping or hurting me?
* Work Smart, Have Fun & Get Things Done (& Get Paid)
* Céad Míle Fáilte - One Hundred Thousand Welcomes To Everyone
* Ubuntu - Humanity Towards Others (Pay It Forward)
* Be Like A Bicycle - Fast, Clean, Healthy, Self Motive, Adaptable & Agile
* Have A Plan, Stick To The Plan, Always Deliver
* Continuous Improvement - Baby Steps + Giant Leaps
* Create WOW Moments - Exciting & Unexpected, inform & inspire
* Join The Herd - Strong, Team focused, Trustworthy, Dependable, Herd Focused.

