content/garden/20231114131806-principles.md
+++
title = "Principles"
author = ["Darrell Banks"]
draft = true
+++

tags
: [Growth and Habits]({{< relref "../../../../../../Dropbox/darrellbanks.com/org/notes/20231031114232-growth_and_habits.md" >}})


## Be mindful about consumption - is this helping or hurting me? {#be-mindful-about-consumption-is-this-helping-or-hurting-me}


## Work Smart, Have Fun &amp; Get Things Done (&amp; Get Paid) {#work-smart-have-fun-and-get-things-done--and-get-paid}


## Céad Míle Fáilte - One Hundred Thousand Welcomes To Everyone {#céad-míle-fáilte-one-hundred-thousand-welcomes-to-everyone}


## Ubuntu - Humanity Towards Others (Pay It Forward) {#ubuntu-humanity-towards-others--pay-it-forward}


## Be Like A Bicycle - Fast, Clean, Healthy, Self Motive, Adaptable &amp; Agile {#be-like-a-bicycle-fast-clean-healthy-self-motive-adaptable-and-agile}


## Have A Plan, Stick To The Plan, Always Deliver {#have-a-plan-stick-to-the-plan-always-deliver}


## Continuous Improvement - Baby Steps + Giant Leaps {#continuous-improvement-baby-steps-plus-giant-leaps}


## Create WOW Moments - Exciting &amp; Unexpected, inform &amp; inspire {#create-wow-moments-exciting-and-unexpected-inform-and-inspire}


## Join The Herd - Strong, Team focused, Trustworthy, Dependable, Herd Focused. {#join-the-herd-strong-team-focused-trustworthy-dependable-herd-focused-dot}
